Revit 2026 API

# DocumentNewSpaceTag Method

---

Creates a new SpaceTag.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpaceTag NewSpaceTag(
	Space space,
	UV point,
	View view
)
```
```vb
Public Function NewSpaceTag (
	space As Space,
	point As UV,
	view As View
) As SpaceTag
```
```cpp
public:
SpaceTag^ NewSpaceTag(
	Space^ space,
	UV^ point,
	View^ view
)
```
```fsharp
member NewSpaceTag :
        space : Space *
        point : UV *
        view : View -> SpaceTag
```

#### Parameters

space Space
     The Space which the tag refers.
point UV
     A 2D point that dictates the location on the level of the space.
view View
     The view where the tag will lie.

#### Return Value

SpaceTag If successful a SpaceTag object will be returned, otherwise . Suitable exceptions will be fired if the parameters are invalid.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the space does not exist in the given document. |
| ArgumentException | Thrown if the view does not exist in the given document. |

#### Reference

Document Class

Autodesk.Revit.Creation Namespace